[
  {
    "id": "6s5df5sdsm",
    "subject": "All Courses",
    "description": "Choose from every course in our website."
  },
  {
    "id": "a7fds24f",
    "subject": "English",
    "description": "Our online self-study, live classes and one-to-one courses with personal tutors are designed by some of the world's English teaching experts. They offer a safe and inclusive learning environment to help you improve your English and achieve your ambitions. Do you need to improve your English language skills? Join thousands of learners from around the world who have improved their English speaking, listening, reading and writing skills with our online courses."
  },
  {
    "id": "a1s2drfes",
    "subject": "Physics",
    "description": "The biggest skill you will learn from studying physics is the ability to focus on a difficult task for many hours at a time. Often, finding a solution to a physics problem requires a multi-step approach, with thoughtful consideration for short term and longer term goals of solving the problem. For example, if one is asked to determine the amount of energy released during an explosion, one might contemplate the inputs and desired outcome in terms of physics units."
  },
  {
    "id": "sd4fgd2dfg",
    "subject": "Math",
    "description": "Mathematical skill acquisition is hierarchical in nature, and each iteration of increased proficiency builds on knowledge of a lower-level primitive. Numerical and mathematical skills are critical predictors of academic success. The last three decades have seen a substantial growth in our understanding of how the human mind and brain represent and process numbers. In particular, research has shown that we share with animals the ability to represent numerical magnitude (the total number of items in a set) and that preverbal infants can process numerical magnitude."
  },
  {
    "id": "2as4dfsdf1",
    "subject": "Chemistry",
    "description": "Understanding the compounds involved in food, water, medical supplements and other items people commonly use is important for both learning about and improving what we use daily. Research chemists work to both understand and improve items and chemical devices we use every day by memorizing chemical makeups and performing research tests. If you're interested in becoming a research chemist, understanding the skills needed for this career can be helpful in determining if this is the right role for you. In this article, we review what a research chemist is and what skills they use frequently."
  },
  {
    "id": "12sd4fsdf",
    "subject": "History",
    "description": "History is the study of life in society in the past, in all its aspect, in relation to present developments and future hopes. It is the story of man in time, an inquiry into the past based on evidence. Indeed, evidence is the raw material of history teaching and learning. It is an Inquiry into what happened in the past, when it happened, and how it happened. It is an inquiry into the inevitable changes in human affairs in the past and the ways these changes affect, influence or determine the patterns of life in the society. History is, or should be an attempt to re-think the past"
  },
  {
    "id": "21sdf4sdf",
    "subject": "Economics",
    "description": "Economics is a social science with stakes in many other fields, including political science, geography, mathematics, sociology, psychology, engineering, law, medicine and business. The central quest of economics is to determine the most logical and effective use of resources to meet private and social goals. Production and employment, investment and savings, health, money and the banking system, government policies on taxation and spending, international trade, industrial organization and regulation, urbanization, environmental issues and legal matters (such as the design and enforcement of property rights), are just a sampling of the concerns at the heart of the science of economics."
  }
]